@lol
Функция: вектор

Сценарий: векторы свободно складываются
Дано вектор с координатами (1, 1)
И вектор с координатами (1, 2)
Когда происходит сложение векторов
Тогда получаем вектор (2, 3) 

Сценарий: один из векторов содержит пустое значение
Дано двумерный вектор, одна из координат которого пуста
И вектор с координатами (1, 3)
Когда происходит сложение векторов
Тогда возникает ArgumentException

Сценарий: векторы имеют разную размерность
Дано вектор с координатами (1, 2, 3)
И вектор с координатами (1, 4)
Когда происходит сложение векторов
Тогда возникает IndexOutOfRangeException